; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v4 - type_1 ?v7 - type_2)
 	      (pred_2 ?v8 - object ?v7 - type_2)
	      (pred_4 ?v4 - type_1 ?v1 - type_3)
	      (pred_1 ?v4 - type_1 ?v8 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v4 - type_1 ?v5 ?v3 - type_2)
       :precondition (and  (pred_3 ?v4 ?v5))
       :effect (and  (pred_3 ?v4 ?v3)
		     (not (pred_3 ?v4 ?v5))))

   (:action op_3
       :parameters (?v4 - type_1 ?v2 - object ?v6 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v6) (pred_3 ?v4 ?v6) (pred_4 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v6)) 
		    (not (pred_4 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_1 ?v2 - object ?v6 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v2 ?v1) (pred_3 ?v4 ?v6))
       :effect (and (pred_2 ?v2 ?v6)
		    (pred_4 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v2 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_1
obj_01 obj_05 - type_3
obj_02 obj_04 obj_07 - type_2
obj_09 obj_06 obj_08 - object)
(:init
(pred_3 obj_03 obj_07)
(pred_4 obj_03 obj_01)
(pred_4 obj_03 obj_05)
(pred_2 obj_09 obj_04)
(pred_2 obj_06 obj_07)
(pred_2 obj_08 obj_04)
)
(:goal
(and
(pred_2 obj_09 obj_04)
(pred_2 obj_06 obj_07)
(pred_2 obj_08 obj_02)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_03 ?b obj_05))))
)
)

; plan
1. (op_1 obj_03 obj_07 obj_04)
   deleted: (pred_3 obj_03 obj_07)
   added: (pred_3 obj_03 obj_04)
   goals met: 2 of 3
2. (op_3 obj_03 obj_08 obj_04 obj_01)
   deleted: (pred_2 obj_08 obj_04) (pred_4 obj_03 obj_01)
   added: (pred_1 obj_03 obj_08 obj_01)
   goals met: 2 of 3
3. (op_1 obj_03 obj_04 obj_02)
   deleted: (pred_3 obj_03 obj_04)
   added: (pred_3 obj_03 obj_02)
   goals met: 2 of 3
4. (op_2 obj_03 obj_08 obj_02 obj_01)
   deleted: (pred_1 obj_03 obj_08 obj_01)
   added: (pred_2 obj_08 obj_02) (pred_4 obj_03 obj_01)
   goals met: 3 of 3
